<%@ Page Title="מתכונים" Language="C#" MasterPageFile="~/MasterPage.master" AutoEventWireup="true" CodeBehind="recipes.aspx.cs" Inherits="MyBreakingBadSite.pages.recipes" %>
<asp:Content ID="Content1" ContentPlaceHolderID="head" runat="server">



    <style>
    body {
        
        
        background-image: url('https://media.istockphoto.com/vectors/cooking-vector-seamless-pattern-hand-drawn-doodle-food-and-kitchen-vector-id1162787549?k=20&m=1162787549&s=612x612&w=0&h=LJW7t5UTw7EIFKsywMZH7ZXFWKCLumaAULvjTA0Vlk4=');
    }


    #box {
        padding: 20px;
        margin: 30px auto;
        max-width: 70%;
        border: 1px solid #000;
        text-align: center;
        border-radius: 5px;
        font-size: 20px;
    }

    #fatBox {
        padding: 30px;
        margin: 30px auto;
        max-width: 80%;
        border: 2px solid #000;
        text-align: center;
        border-radius: 5px;
    }
    .blue {
        background-color: rgba(0, 0, 0, 0.3);
        color: #fff;
    }



</style>








</asp:Content>
<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolder1" runat="server">

<html>
    <body>
            <div id="box" class="blue">

        <h1 style="font-size: 50px"><b>מתכונים</b></h1>

        
        <h2 id="makingcake" style ="text-align:center"> הכנת עוגה בסיסית</h2>
        <p>

            <ol style="text-align:right" type="1">
                <big>
                    <b>
                        :מרכיבים
                    <li>6 ביצים L - בטמפרטורת החדר. מופרדות.</li>
                    <li>1 כוס סוכר לבן.</li>
                    <li>1 כפית קליפת לימון מגוררת.</li>
                    <li>1 כף מיץ לימון סחוט.</li>
                    <li>2 כפות מים.</li>
                    <li>1 כפית תמצית וניל -או כל תמצית אחרת שמתחשק לכם.</li>
                    <li>1 כוס קמח לכל מטרה - מנופה.</li>
                    <li>רבע כפית שטוחה מלח.</li>
                    <li>1/2 כפית שטוחה אבקת אפייה.</li>
                        
                        </b>
                </big>
            </ol>
            <p style="margin-left: 2.5em;padding: 0 7em 2em 0;border-width: 2px;">.</p>
            <ol style="text-align: right" type="1">
                <b>
                <big>הוראות הכנה</big>
                <li>שמנו את התבנית בספרי קנולה ופזרו קמח. הפכו
                    תבנית , טפחו קלות כדי שכל שאריות הקמח שלא
                    נידבקו יפרדו מהתבנית</li>
                <li>חממו תנור ל 180 מ"צ טורבו.</li>
                <li>
                    במיקסר הקציפו את החלמונים הוסיפו בהדרגה חצי
                    כוס סוכר. לאחר מכן הוסיפו את המיץ לימון והלימון
                    המגורר. מים ותמצית וניל.
                </li>
                <li>הקציפו על מהירות בינונית עד שהתערובת תהיה
                    אורירית. הזהרו מהקצפת יתר.</li>
                <li>סגרו מיקסר, הוסיפו את הקמח ואבקת האפייה. ועם 
                    לקקן קפלו את הקמח לתוך הבלילה עד שהוא יתמזג
                    באופן מושלם.</li>
                <li>בקערה נפרדת הקציפו את החלבונים עם מעט מלח,
                    לאחר שיש קצף רך הוסיפו את החצי השני של הסוכר
                    בכמויות קטנות בכל פעם וערבבו.</li>
                <li>העבירו רבע מהכמות לתערבות החלמונים בעזרת
                    לקקן או כף וערבבו בתנועות גדולות
                    ורחבות. לא בבחישה.</li>
                <li>העבירו כך את כל כמות החלמונים.</li>
                <li>שהתערובת נראת אחידה צקו אותה לתבנית. ישרו עם לקקן.
                    והכניסו לתנור ל 45 דקות או שקיסם יוצא יבש</li>
                <li>העבירו לרשת קירור.</li>
                <li>לאחר הצינון להפריד את העוגה מהתבנית.</li>
                <li>אם רוצים ניתן לצפות בקרם או באבקת סוכר.</li>
                </b>
            </ol>
            <img src="../images/cakepng.png" />

            <h3 style="text-align: center"><a href="Mainpage.aspx">בחזרה לעמוד הראשי...</a></h3>
            <p style="margin-left: 2.5em;padding: 0 7em 2em 0;border-width: 2px;">.</p>
            <p style="margin-left: 2.5em;padding: 0 7em 2em 0;border-width: 2px;">.</p>
            <h1 id="makingknafeh" style="text-align:center">מתתכון לכנאפה</h1>
            <p>
                <h2>מרכיבים:</h2>
                <ol  style="text-align: right; font-size: 30px"> <b>
                    <li>80 גרם חמאה



</li>
                    <li>250 גרם שערות קדאיף



</li>
                    <li>250 גבינת ריקוטה (או 200 גרם ריקוטה + 50 גרם גבינת עיזים)



</li>
                    <li>לסירופ:
                        כוס מים
                        שליש כוס סוכר

                </b>
                </ol>

                <h2>אופן ההכנה:</h2>
                <ol type="1" style="text-align: right; font-size: 30px"> <b>

                    <li>
                        הכנת הסירופ:
                        שופכים לסיר קטן את המים והסוכר ומביאים לרתיחה קלה תוך כדי בחישה (כשיש בועות קטנות).
                        מחממים על אש בינונית במשך כ-5 דקות,
                        עד שהסוכר נמס. מסירים מהאש ומניחים בצד.




                    </li>
                    <li>
                        הכנת הכנאפה:

                      <li>   ממיסים את החמאה כמה שניות במיקרוגל.</li>

                      <li>   משמנים תחתית של מחבת עם 3 כפות חמאה מומסת, מבלי להדליק עדיין את האש (יש
                        להשתמש במחבת בקוטר 26-28 עם ציפוי שאינו נדבק).</li>

                       <li>  מערבבים את שערות הקדאיף עם יתר החמאה המומסת
                        ומפרידים את השערות תוך כדי בעזרת האצבעות</li>


                      <li>   מפזרים חצי מכמות שערות הקדאיף באופן אחיד בתחתית
                        המחבת ומחממים את המחבת על אש בינונית.</li>


                      <li>   מורחים באמצעות כף את הגבינה באופן אחיד על שיערות
                        הקדאיף ומפזרים מעל הגבינה את יתר שערות הקדאיף</li>

                        מכסים את המחבת ומטגנים במשך כ-7 דקות עד שתחתית
                        הכנאפה מזהיבה קצת והופכת להיות מעט פריכה.</li>


                       <li>  הופכים את הכנאפה (ניתן להיעזר בצלחת כדי להפוך ולהחזיר למחבת),
                        מכסים ומטגנים את הצד השני במשך כ-3 דקות נוספות.</li>


                       <li> מעבירים לצלחת הגשה ויוצקים מעל את הסירופ באופן אחיד.</li>
          
                    </b>
                </ol>
                <img src="https://redpathsugar.com/emshare/views/modules/asset/downloads/originals/2019/08/67163/Knafeh_landscape_hero_web.jpg/Knafeh_landscape_hero_web.jpg" />
                <h3 style="text-align: center"><a href="Mainpage.aspx">בחזרה לעמוד הראשי...</a></h3>

                <h1 id="refaeloballs" style="text-align: center">הכנת כדורי רפאלו</h1>
                <ol style="text-align:right; font-size: 25px"> <b>
                    מרכיבים:
                    <li>200 גרם שוקולד לבן (חלבי)

</li>
                    <li>40 גרם חמאה

</li>
                    <li>4 כפות חלב

</li>
                    <li>160 גרם קוקוס טחון (1+2/3 כוסות)

</li>
                    <li>16 אגוזי לוז

</li>
                    <li>*קוקוס לציפוי


</li>
                    </b>             
                </ol>

                <ol style="text-align:right; font-size: 30px"> <b>
                    <h3>אופן ההכנה</h3>
                    <li> -מניחים בקערה את קוביות השוקולד הלבן עם החלב
                        והחמאה וממיסים במיקרוגל כ-10 שניות. מוציאים ומערבבים. אם עדיין לא נמס,
                        מחזירים למיקרוגל ל-10 שניות נוספות, מוציאים ומערבבים עד לקבלת תערובת חלקה.

</li>
                    <li>מוסיפים את הקוקוס ומערבבים.
                        מכניסים את התערובת למקרר למשך 20-30 דקות,
                        עד שהיא מתייצבת וקל להכין ממנה כדורים </li>
                    <li>עזרת הידיים יוצרים כדורים בקוטר של כ-3 ס”מ 
                        ובכל כדור מחביאים אגוז לוז.
                        מגלגלים את הכדורים בקוקוס ומניחים על צלחת/מגש. </li>
                    <li>-מכניסים למקרר להתייצבות למשך כשעה לפני ההגשה.

 </li>

                    </b>
                </ol>
                <img src="https://www.10dakot.co.il/wp-content/uploads/2017/12/DSC_0045.jpg" />
                <h3 style="text-align: center"><a href="Mainpage.aspx">בחזרה לעמוד הראשי...</a></h3>

                <h1 style="text-align:center" id="strawberriesmoss"> הכנת מוס תותים</h1>
                <ol style="text-align:right; font-size: 25px"> <b>
                    <h3>מרכיבים</h3>
                    <li> מיכל שמנת מתוקה/קצפת צמחית (250 מ”ל)

</li>
                    <li>2 כפות מלאות אבקת אינסטנט פודינג וניל

 </li>
                    <li>2-4 כפות אבקת סוכר לפי הטעם (*זה תלוי במתיקות התותים)

 </li>
                    <li>200 גרם תותים חתוכים גס (זה יוצא בסביבות כוס ורבע של 240 מ”ל)


 </li>
                    <li> </li>
                    <li> </li>
                    </b>
                </ol>
                <ol style="text-align:right; font-size: 25px"> <b>
                    <h3>אופן ההכנה</h3>
                    <li>-טוחנים את התותים בבלנדר עד לקבלת מחית אחידה (ניתן להשתמש במוט בלנדר ידני).

 </li>
                    <li>-מקציפים את השמנת במשך כ-20 שניות. מוסיפים פודינג וניל,
                        מחית תותים ואבקת סוכר ומקציפים עד לקבלת קרם ורוד יציב.

 </li>
                    <li> -מעבירים לכוסות אישיות (מומלץ להשתמש בשקית זילוף) ושומרים במקרר.

</li>
                    <li>*ניתן להכין מראש ולהקפיא.

 </li>
                    <img src="https://www.chef-lavan.co.il/uploads/f_587fc51566d28_1484768533.jpg" />
                    <h3 style="text-align: center"><a href="Mainpage.aspx">בחזרה לעמוד הראשי...</a></h3>





                </ol>

                <h1 style="text-align:center" id="browniesmuffins">הכנת מאפינס בראוניז 

                <ol style="text-align:right; font-size: 25px"> <b>

                    <h3>מרכיבים</h3>
                    <li>1 ביצה

 </li>
                    <li>3 כפות (50 ג’) גדושות סוכר

 </li>
                    <li> 50 גרם שוקולד מריר

</li>
                    <li>שליש כוס (66 ג’) שמן

 </li>
                    <li>כפית (5 מ”ל) תמצית וניל

 </li>
                    <li> 2 כפות (20 ג’) אבקת שוקולית

</li>
                    <li>
                        חצי כוס (70 ג’) קמח רגיל


                    </li>
                    <li>
                        10 קוביות שוקולד חלב/לבן/מריר רצוי במילוי קרם (*השתמשתי בשוקולד “רגוסה”)



                    </li>




                </b>
                </ol>
                    <ol style="text-align:right; font-size: 25px"> <b>
                        <h3>אופן ההכנה</h3>
                        <li>מחממים תנור ל180 מעלות ומשמנים תבנית שקעים/מאפינס (אם משתמשים במנג’טים
                            מנייר פרגמנט אין צורך לשמן) </li>
                        <li> מניחים את קוביות השוקולד עם השמן בקערה וממיסים במיקרוגל מספר שניות. מוציאים
                            ומערבבים לתערובת חלקה.</li>
                        <li>מערבבים היטב את הביצה עם הסוכר. מוסיפים תמצית וניל ואת תערובת השוקולד
                            ומערבבים תוך כדי. מוסיפים את אבקת השוקולית והקמח ומערבבים עד לאיחוד החומרים
                            (מתקבלת בלילה שוקולדית סמיכה). </li>
                        <li>יוצקים כף מהבלילה לתבנית. מניחים בכל שקע קוביית שוקולד ובעזרת 
                            האצבע מטביעים לתוך השוקולד. מכסים בכחצי כף נוספת של הבלילה ומיישרים בעזרת הכף
                            או קצות אצבעות רטובות </li>
                        <li>-מכניסים לתנור (שחומם מראש על 180 מעלות) ואופים במשך  כ-15 דקות.

 </li>
                   

                    </ol>
                    <img src="https://createyum.com/wp-content/uploads/2020/04/mini-brownie-muffins-1.jpg" />
                    <h3 style="text-align: center"><a href="Mainpage.aspx">בחזרה לעמוד הראשי...</a></h3>


                    <h1 style="text-align: center" id="chocolatepudding">הכנת פודינג שוקולד</h1></h1>
                    <ol style="text-align:right; font-size: 25px"> <b>
                        <h2>מרכיבים</h2>

                        <li>2 כוסות חלב רגיל או סויה

 </li>
                        <li>2 כפות קורנפלור (לא גדושות ולא שטוחות, באמצע)

 </li>
                        <li> 6 כפות מים קרים

</li>
                        <li>100 גרם שוקולד מריר (אפשר להכין גם עם שוקולד חלב)

 </li>
                        <li> 4 כפות גדושות סוכר

</li>
                        <li> מיכל שמנת מתוקה/ קצפת צמחית (250 מ”ל)

</li>
                        <li> 2 כפות גדושות אינסטנט פודינג וניל


</li>
                        <li> </li>



                        </b>
                    </ol>
                <ol style="text-align:right; font-size: 25px"> <b>
                    <h2>אופן ההכנה</h2>
                    <li> מחממים בסיר קטן את החלב עם הסוכר על אש בינונית-נמוכה.
                        מערבבים עד שהסוכר נמס בתוך החלב</li>
                    <li>מערבבים 2 כפות קורנפלור עם 6 כפות מים קרים עד לקבלת נוזל חלק ללא גושים.
                        כשהחלב רותח (מבעבע) מוסיפים את מי הקורנפלור ומערבבים כל הזמן במשך 1-2 דקות, עד שהחלב מסמיך (לא מפסיקים לערבב!).
                        הערה: אם לאחר כ-2 דקות התערובת לא מסמיכה, יש לערבב כף קורנפלור נוספת עם 2-3 כפות מים ולהוסיף לחלב.
                        לערבב עד שהחלב מסמיך. </li>
                    <li>שוברים את השוקולד לקוביות ומוסיפים לתערובת החלב,
                        מערבבים עד שהשוקולד נמס לגמרי ומתקבלת תערובת שוקולדית חלקה וסמיכה. </li>
                    <li>מסירים מהאש ומעבירים לכוסות הגשה בגובה 2/3 מהכוס
                        (רצוי כוסות מזכוכית מאחר והתערובת חמה) . </li>
                    <li>מניחים לתערובת להתקרר לטמפ’ החדר </li>
                    <li>-בינתיים מכינים את הקצפת: מקציפים את השמנת עם האינסטנט פודינג וניל עד לקבלת
                        קצפת יציבה. </li>
                    <li>-בעזרת שקית זילוף או כף ממלאים מעל שכבת פודינג השוקולד.

 </li>
                    <li> *עוטפים בניילון נצמד ושומרים במקרר.

</li>
                    <li>*הפודינג שוקולד נשמרים במקרר 4-5 ימים.

 </li>




                    </b>
                </ol>
                <img src="https://www.10dakot.co.il/wp-content/uploads/2015/11/DSC_02955.jpg" />
                <h3 style="text-align: center"><a href="Mainpage.aspx">בחזרה לעמוד הראשי...</a></h3>


                <h1 style="text-align:center" id="belguimwaffle">הכנת וופל בלגי</h1>

                <ol style="text-align:right; font-size: 25px"> <b>
                    <h2 style="text-align:center">מרכיבים</h2>
                    <li> כוס קמח רגיל

</li>
                    <li>כפית שטוחה שמרים יבשים

 </li>
                    <li>3 כפות סוכר לבן

 </li>
                    <li>חצי כוס חלב חמים (לא רותח)

 </li>
                    <li>1 כפית תמצית וניל

 </li>
                    <li> 1 ביצה

</li>
                    <li>שליש כוס שמן

 </li>
                    <li> קמצוץ מלח


</li>
                    <li> </li>
                    </b>
                </ol>
                <ol style="text-align:right; font-size: 25px"> <b>

                    <li>מערבבים היטב בקערה את הקמח עם השמרים. מוסיפים סוכר, חלב, תמצית וניל וביצה
                        ומערבבים היטב </li>
                    <li> בסוף מוסיפים שמן וקמצוץ מלח ומערבבים עד לקבלת תערובת אחידה (אין לערבב יותר
                        מידי אחרת המרקם יהפוך לקשה וכבד).</li>
                    <li>-מכסים את התערובת ומניחים בצד למשך כ10 דקות (לא חובה).

 </li>
                    <li>משמנים היטב את המכשיר ומחממים אותו כשהוא סגור. כשהוא חם מאוד, פותחים אותו
                        וממלאים את השקעים. סוגרים את המכשיר למשך 7-8 דקות (מומלץ לעבוד עם סטופר).
                        פותחים בזהירות את המכשיר, מוצאים את הוופל ומניחים על צלחת 
                        (אין להניח אחד על השני מאחר וזה יגרום לוופלים להתרכך). </li>
                    <li>*מומלץ להזליף מעל סירופ שוקולד/מייפל ו/או להגיש עם קצפת, פירות, גלידה וכו’.

 </li>
                    <li> </li>
                    <li> </li>
                    <li> </li>

                    </b>
                </ol>
                <img src="https://www.10dakot.co.il/wp-content/uploads/2015/10/DSC_0121-%D7%A2%D7%95%D7%AA%D7%A7.jpg" />
                <h3 style="text-align: center"><a href="Mainpage.aspx">בחזרה לעמוד הראשי...</a></h3>

                <h1 style="text-align: center" id="lotuscups">הכנת קינוח קרם גבינה ולוטוס</h1>
                <ol style="text-align:right; font-size: 25px"> <b>

                    <li> 12 עוגיות לוטוס מרוסקות לפירורים

</li>
                    <li>מיכל שמנת מתוקה (250 מ”ל)

 </li>
                    <li>חצי כוס חלב

 </li>
                    <li> 3 כפות אבקת אינסטנט פודינג וניל

</li>
                    <li>3 כפות גבינה לבנה

 </li>
                    <li> כף ממרח לוטוס


</li>
                    <li> </li>
                    <li> </li>

                    </b>
                </ol>
                <ol style="text-align:right; font-size: 25px"> <b>
                    <h2>אופן ההכנה</h2>
                    <li> מקציפים בקערה שמנת מתוקה במשך כדקה (טיפ להקצפה מוצלחת: מומלץ להכניס את
                        השמנת למקפיא 10 דקות לפני ההקצפה). מוסיפים חלב ואינסטנט פודינג וניל וממשיכים
                        להקציף עד לקבלת קצפת יציבה. מוסיפים את הגבינה ומערבבים בעזרת כף בתנועות קיפול</li>

                    <li>הרכבת המנה: מניחים בתחתית כל כוס או גביע פירורי עוגיות. מעל מזליפים מתערובת קרם
                        הגבינה (ניתן להשתמש בשקית זילוף או בשקית אוכל רגילה ולגזור את הפינה). מעל שמים
                        שכבה נוספת של פירורי עוגיות ומעל שוב מזליפים מהקרם. </li>
                    <li>מחממים במיקרוגל כף ממרח לוטוס עד שנעשה נוזלי (אין לחמם יותר מידי).
                        מוצאים ומערבבים. בעזרת כפית מזליפים מעט מעל הקרם. </li>
                    <li>-עוטפים בניילון נצמד ומכניסים למקרר כ-3 שעות לפחות לפני ההגשה.

 </li>

                    </b>
                </ol>
                <img src="https://www.10dakot.co.il/wp-content/uploads/2015/05/DSC_0021-%D7%A2%D7%95%D7%AA%D7%A7.jpg" />
                <h3 style="text-align: center"><a href="Mainpage.aspx">בחזרה לעמוד הראשי...</a></h3>




                
            </p>



        </p>







    </body>
</html>
</asp:Content>
